package AcoKP;

/**
 * Constant
 * Author： wychen
 * Date: 2017/12/13
 * Time: 19:34
 */
public class Constant {
    //物品数目
    static int num = 4;

    //物品重量以及价值
    //v=[391 444 250 330 246 400 150 266 268 293 471 388 364 493 202 161 410 270 384 486];   %价值
    //w=[55  52  59  24  52  46  45  34  34  59  59  28  57  21  47  66  64  42  22  23];       %重量
    static float thing[][] = {{391.0f,55.0f},
            {250.0f,59.0f},
            {330.0f,24.0f},
            {246.0f,52.0f},
            {400,46},
            {150,45},
            {266,34},
            {268,34},
            {293,59},
            {471,59},
            {388,28},
            {364,57},
            {493,21},
            {202,47},
            {161,66},
            {410,64},
            {270,42},
            {384,22},
            {486,23}
    };

    //信息素初值
    static final float pheromone = 10.0f;

    //背包最大容量
    static float capacity = 500;

}
